p2000t/M2000/src/Allegro.c
    DisplayHeight = monitorInfo.y2 - monitorInfo.y1;
    DisplayWidth = DisplayHeight * 4 / 3;
    DisplayVBorder = 0;
    DisplayHBorder = (monitorInfo.x2 - monitorInfo.x1 - DisplayWidth) / 2;
    DisplayTileWidth = DisplayWidth / 40;
    DisplayTileHeight = DisplayHeight / 24;
    if (Verbose) printf("Fullscreen resizing to %ix%i\n",DisplayWidth + 2*DisplayHBorder, DisplayHeight + 2*DisplayVBorder);
    al_resize_display(display, DisplayWidth + 2*DisplayHBorder, DisplayHeight + 2*DisplayVBorder);
    al_set_display_flag(display , ALLEGRO_FULLSCREEN_WINDOW , 1);
  }
}

int CopyFile(ALLEGRO_PATH *sourceFolder, const char * filename, ALLEGRO_PATH *destinationFolder) 
{
  if (!al_make_directory(al_path_cstr(destinationFolder, PATH_SEPARATOR))) return 1;

  al_set_path_filename(sourceFolder, filename);
  al_set_path_filename(destinationFolder, filename);
  const char * sourceFile = al_path_cstr(sourceFolder, PATH_SEPARATOR);
  const char * destFile = al_path_cstr(destinationFolder, PATH_SEPARATOR);
  al_set_path_filename(sourceFolder, NULL);
  al_set_path_filename(destinationFolder, NULL);
  if (!al_filename_exists(sourceFile)) {
    if (Verbose) printf("[CopyFile] SourceFile %s does not exist\n", sourceFile);
    return 1;
  }
  if (al_filename_exists(destFile)) {
    if (Verbose) printf("[CopyFile] DestFile %s already exists\n", destFile);
    return 0;
  }

  if (Verbose) printf("[CopyFile] Copying %s to %s ...", sourceFile, destFile);
  FILE *f_s;
  FILE *f_d;
  char buf[1024];
  size_t size;
  int ret = 1;
  if ((f_s = fopen(sourceFile, "rb"))) {
    if ((f_d = fopen(destFile, "wb"))) {
      while ((size = fread(buf, 1, 1024, f_s)))
        fwrite(buf, 1, size, f_d);
      fclose(f_d);
      ret = 0;
    }
    fclose(f_s);
  }
  if (Verbose) puts(ret ? "FAILED" : "OK");
  return ret;
}

/****************************************************************************/
/*** Initialise all resources needed by the Linux/SVGALib implementation  ***/
/****************************************************************************/
int InitMachine(void)
{
  int i;
  int startFullScreen = (videomode == FULLSCREEN_VIDEO_MODE);
  //only support CPU speeds 10, 20, 50, 100, 120, 200 and 500
  CpuSpeed = Z80_IPeriod*IFreq*100/2500000;
  if (CpuSpeed > 350) CpuSpeed = 500;
  else if (CpuSpeed > 160) CpuSpeed = 200;
  else if (CpuSpeed > 110) CpuSpeed = 120;
  else if (CpuSpeed > 75) CpuSpeed = 100;
  else if (CpuSpeed > 35) CpuSpeed = 50;
  else if (CpuSpeed > 15) CpuSpeed = 20;
  else CpuSpeed = 10;

  //only support 50Hz and 60Hz
  IFreq = IFreq >= 55 ? 60 : 50; 

  if (TapeName) 
    currentTapePath = al_create_path(TapeName);

  /* get primary display monitor info */
  for (int i=0; i<al_get_num_video_adapters(); i++) {
    if (al_get_monitor_info(i, &monitorInfo) && monitorInfo.x1 == 0 && monitorInfo.y1 == 0) {
      if (Verbose) printf("Primary fullscreen display: %i x %i\n", monitorInfo.x2 - monitorInfo.x1, monitorInfo.y2 - monitorInfo.y1);
      break; //primary display found
    }
  }

  /* create M2000 folder inside user's Documents folder */
  docPath = al_get_standard_path(ALLEGRO_USER_DOCUMENTS_PATH);
  ALLEGRO_PATH *resourcePath = al_get_standard_path(ALLEGRO_RESOURCES_PATH);
  // debian install check
  if (!strcmp(al_path_cstr(resourcePath, PATH_SEPARATOR), "/usr/bin/"))
    resourcePath = al_create_path_for_directory("/usr/share/M2000/");

  al_append_path_component(docPath, "M2000");
  if (al_make_directory(al_path_cstr(docPath, PATH_SEPARATOR))) {
    CopyFile(resourcePath, "README.md", docPath);

    al_append_path_component((userCassettesPath = al_clone_path(docPath)), "Cassettes");
    if (!al_filename_exists(al_path_cstr(userCassettesPath, PATH_SEPARATOR)))
      for (i=0; installCassettes[i]; i++)
        CopyFile(resourcePath, installCassettes[i], userCassettesPath);

    al_append_path_component((userCartridgesPath = al_clone_path(docPath)), "Cartridges");
    if (!al_filename_exists(al_path_cstr(userCartridgesPath, PATH_SEPARATOR)))
      for (i=0; installCartridges[i]; i++)
        CopyFile(resourcePath, installCartridges[i], userCartridgesPath);

    al_append_path_component((userScreenshotsPath = al_clone_path(docPath)), "Screenshots");
    al_make_directory(al_path_cstr(userScreenshotsPath, PATH_SEPARATOR));

    al_append_path_component((userVideoRamDumpsPath = al_clone_path(docPath)), "VideoRAM dumps");
    al_make_directory(al_path_cstr(userVideoRamDumpsPath, PATH_SEPARATOR));

    al_append_path_component((userStateSnapshotsPath= al_clone_path(docPath)), "State snapshots");
    al_make_directory(al_path_cstr(userStateSnapshotsPath, PATH_SEPARATOR));
  }
  al_destroy_path(resourcePath);

  cassetteChooser = al_create_native_file_dialog(userCassettesPath ? al_path_cstr(userCassettesPath, PATH_SEPARATOR) : NULL,
    "Select a .cas cassette file", "*.*", 0); //file doesn't have to exist
  cartridgeChooser = al_create_native_file_dialog(userCartridgesPath ? al_path_cstr(userCartridgesPath, PATH_SEPARATOR) : NULL,
    "Select a .bin cartridge file", "*.bin", ALLEGRO_FILECHOOSER_FILE_MUST_EXIST);
  screenshotChooser = al_create_native_file_dialog(userScreenshotsPath ? al_path_cstr(userScreenshotsPath, PATH_SEPARATOR) : NULL,
    "Save as .png or .bmp file",  "*.png;*.bmp", ALLEGRO_FILECHOOSER_SAVE);
  vRamLoadChooser = al_create_native_file_dialog(userVideoRamDumpsPath ? al_path_cstr(userVideoRamDumpsPath, PATH_SEPARATOR) : NULL,
    "Select a .vram file",  "*.vram", ALLEGRO_FILECHOOSER_FILE_MUST_EXIST);
  vRamSaveChooser = al_create_native_file_dialog(userVideoRamDumpsPath ? al_path_cstr(userVideoRamDumpsPath, PATH_SEPARATOR) : NULL,
    "Save as .vram file",  "*.vram", ALLEGRO_FILECHOOSER_SAVE);
  stateLoadChooser = al_create_native_file_dialog(userStateSnapshotsPath ? al_path_cstr(userStateSnapshotsPath, PATH_SEPARATOR) : NULL,
    "Select a .dmp file",  "*.dmp", ALLEGRO_FILECHOOSER_FILE_MUST_EXIST);
  stateSaveChooser = al_create_native_file_dialog(userStateSnapshotsPath ? al_path_cstr(userStateSnapshotsPath, PATH_SEPARATOR) : NULL,
    "Save as .dmp file",  "*.dmp", ALLEGRO_FILECHOOSER_SAVE);

  if (joymode) {
    if (Verbose) printf("Initialising and detecting joystick... ");
    joymode=0; //assume not found
    if (al_install_joystick()) {
      if ((joystick = al_get_joystick(0)) != NULL) {
        joymode = 1;
        if (Verbose) puts("OK");
      }
    }
    if (!joymode && Verbose) puts("FAILED");
  }

  if (Verbose) printf("Creating the display window... ");
  InitVideoMode();
  UpdateDisplaySettings();
#ifdef __linux__
  al_set_new_display_flags (ALLEGRO_WINDOWED | ALLEGRO_GTK_TOPLEVEL); // ALLEGRO_GTK_TOPLEVEL required for menu in Linux
#else
  al_set_new_display_flags (ALLEGRO_WINDOWED);
#endif
  al_set_new_display_option(ALLEGRO_SINGLE_BUFFER, 1, ALLEGRO_REQUIRE); //require single buffer
#ifdef __linux__
  // for Linux create smallest display, as it does not correctly scale back
  if ((display = al_create_display(Displays[1][0], Displays[1][1])) == NULL)
#else
  if ((display = al_create_display(DisplayWidth + 2*DisplayHBorder, DisplayHeight + 2*DisplayVBorder)) == NULL)
#endif
    return ReturnErrorMessage("Could not initialize display.");

